#include <stdio.h>

int main() {
    SetConsoleCP (1251);
    SetConsoleOutputCP (1251) ;
    int n;
    printf("Введіть довжину послідовності n: ");
    scanf("%d", &n);

    int dp[n + 1][2]; // створюємо таблицю для динамічного програмування
    dp[1][0] = dp[1][1] = 1; // початкові значення (для n = 1)
    for(int i = 2; i <= n; i++) {
        dp[i][0] = (dp[i - 1][0] + dp[i - 1][1]) % 12345; // обчислюємо кількість послідовностей, закінчення яких 0
        dp[i][1] = (dp[i - 1][0] + dp[i - 1][1]) % 12345; // обчислюємо кількість послідовностей, закінчення яких 1
    }

    printf("Кількість шуканих послідовностей: %d", (dp[n][0] + dp[n][1]) % 12345); // вивод

    return 0;
}
