#include <stdio.h>

int main() {
    SetConsoleCP (1251);
    SetConsoleOutputCP (1251) ;
    int n, i, count = 0; // оголошуємо змінні n, i та count
    printf("Введіть натуральне число n: "); // просимо користувача ввести число
    scanf("%d", &n); // зчитуємо число з консолі
    for (i = 1; i <= n; i++) { // запускаємо цикл від 1 до n
        if (n % i == n / i) { // перевіряємо, чи є i дільником n
            count++; // якщо так, збільшуємо лічильник count на 1
        }
    }
    printf("Кількість рівних дільників числа %d: %d\n", n, count); // виводи результата
    return 0; // повертаємо 0, щоб позначити успішне завершення програми
}
